000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/РаспоряжениеНаПриемку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспоряжениеНаПриемку</name>
  <registerRecords>InformationRegister.РекламныеМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКПриемке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиРекламныхМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаКВМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РекламныеМатериалы/РекламныеМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РекламныеМатериалы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламнаяПлоскость</name>
    <type>
      <types>CatalogRef.РекламныеПлоскости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламныйМатериал</name>
    <type>
      <types>CatalogRef.РекламныеМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РаспоряжениеНаПриемку</name>
    <type>
      <types>DocumentRef.РаспоряжениеНаПриемку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/РекламныеМатериалыКПриемке/РекламныеМатериалыКПриемке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РекламныеМатериалыКПриемке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РекламныйМатериал</name>
    <type>
      <types>CatalogRef.РекламныеМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламнаяПлоскость</name>
    <type>
      <types>CatalogRef.РекламныеПлоскости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРаспоряжение</name>
    <type>
      <types>DocumentRef.РаспоряжениеНаПриемку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.РаспоряжениеНаПриемку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ПроведениеСервер.ОтразитьДвиженияПоРегистру("РекламныеМатериалы",ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьДвиженияПоРегистру("РекламныеМатериалыКПриемке",ДополнительныеСвойства, Движения, Отказ);
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()

	СписокОбъектов = Новый Массив;
	СписокОбъектов.Добавить(Движения.РекламныеМатериалы);
	СписокОбъектов.Добавить(Движения.РекламныеМатериалыКПриемке);

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", СписокОбъектов);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЗаполнениеОбъектовСобытия.ОбщиеДействияПередЗаписью(ЭтотОбъект, Отказ);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли; 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		Отказ = КонтрольЗанятостиПлоскостей();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли; 
КонецПроцедуры

Функция КонтрольЗанятостиПлоскостей()
	Отказ = Ложь;
	
	Для Каждого строка из РекламныеМатериалы цикл
		Если ЗначениеЗаполнено(строка.РекламнаяПлоскость)  тогда 
			
		Отказ = ПроверитьСтроку(Строка.РекламнаяПлоскость);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ; 
КонецФункции



Функция ПроверитьСтроку(РекламнаяПлоскость)
	Отказ = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалы.ДатаС КАК ДатаС,
		|	РекламныеМатериалы.ДатаПо КАК ДатаПо,
		|	РекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалы.РаспоряжениеНаПриемку КАК РаспоряжениеНаПриемку
		|ИЗ
		|	РегистрСведений.РекламныеМатериалы КАК РекламныеМатериалы
		|ГДЕ
		|	РекламныеМатериалы.РекламнаяПлоскость = &РекламнаяПлоскость
		|	И РекламныеМатериалы.Магазин = &Магазин
		|	И (РекламныеМатериалы.ДатаС МЕЖДУ &ДатаС И &ДатаПо
		|			ИЛИ РекламныеМатериалы.ДатаПо МЕЖДУ &ДатаС И &ДатаПо)
		|	И РекламныеМатериалы.Регистратор <> &Регистратор";
	
	Запрос.УстановитьПараметр("ДатаПо", ДатаПо);
	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("РекламнаяПлоскость", РекламнаяПлоскость);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ТекстСообщения =ТекстСообщения + "Рекламная плоскость " + РекламнаяПлоскость + " занята " +  ВыборкаДетальныеЗаписи.РекламныйМатериал + " с " + выборкаДетальныеЗаписи.ДатаС + " по " + выборкаДетальныеЗаписи.ДатаПо+ "!   ";
	КонецЦикла;
	
	Если НЕ РезультатЗапроса.Пустой() тогда
		Сообщение = Новый СообщениеПользователю;
    	Сообщение.Текст = ТекстСообщения;
        Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ; 
КонецФункции
